Tekla Open API Reference for Tekla Structures 2025
ProfileItem.ModifyProfileItemUserParameter Method
 Modify user parameter of library profile item. Modify is needed for profile item for updating changes to profile database
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ModifyProfileItemUserParameter(
	ProfileItemParameter value
)
Public Function ModifyProfileItemUserParameter (
	value As ProfileItemParameter
) As Boolean
Parameters
value
Type: Tekla.Structures.Catalogs.ProfileItemParameter
[Missing <param name="value"/> documentation for "M:Tekla.Structures.Catalogs.ProfileItem.ModifyProfileItemUserParameter(Tekla.Structures.Catalogs.ProfileItemParameter)"]
Return Value
Type: Boolean
True on success.
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace